//================================================================================================================
//
// DirectXの敵ヘッダーファイル [enemy.h]
// Author : TENMA
//
//================================================================================================================
#ifndef _ENEMY_H_
#define _ENEMY_H_

//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "game.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************
#define MAX_ENEMY		(64)								// 敵の最大数
#define ENEMY_SIZE		(100)								// 敵のサイズ

//**********************************************************************************
//*** 敵の状態 ***
//**********************************************************************************
typedef enum
{
	ENEMYSTATE_NORMAL = 0,		// 通常状態
	ENEMYSTATE_DAMAGE,			// ダメージ状態
	ENEMYSTATE_APPEAR,			// 出現状態
	ENEMYSTATE_DEATH,			// 死亡状態
	ENEMYSTATE_DOWN,			// ダウン状態
	ENEMYSTATE_MAX				// 状態の総数
}ENEMYSTATE;

//**********************************************************************************
//*** 敵のテクスチャの種類 ***
//**********************************************************************************
typedef enum
{
	ENEMYTEX_SLIME = 0,				// スライム
	ENEMYTEX_MAX
}ENEMYTEX;

//**********************************************************************************
//*** 敵構造体 ***
//**********************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;			// 敵の位置
	D3DXVECTOR3 move;			// 敵の移動量
	D3DXCOLOR col;				// 敵の色
	ENEMYTEX tex;				// 敵のテクスチャの種類
	int nTexMaxU;				// テクスチャ座標の分割数	(U座標)
	int nTexMaxV;				// テクスチャ座標の分割数	(V座標)
	int nCounterAnim;			// アニメーションカウンター
	int nPatternAnim;			// アニメーションNo
	float fWidth;				// 敵の横幅
	float fHeight;				// 敵の身長
	ENEMYSTATE state;			// 敵の状態
	int nCounterState;			// 状態カウンター(状態の経過秒数)
	int nLife;					// 敵の体力
	bool bUse;					// 使用されているか
} ENEMY, *PENEMY;

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitEnemy(void);
void UninitEnemy(void);
void UpdateEnemy(void);
void DrawEnemy(void);
void SetEnemy(D3DXVECTOR3 pos, D3DXVECTOR3 move, D3DXCOLOR col, ENEMYTEX tex, float fWidth, float fHeight, int nLife);
bool CollisionEnemy(D3DXVECTOR3 pos, float fWidth, float fHeight);
ENEMY *GetEnemy(void);
int GetTotalEnemy(void);

#endif // !_Enemy_H_
