//================================================================================================================
//
// DirectXのゲーム関連用のcppファイル [game.cpp]
// Author : TENMA
//
//================================================================================================================
//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "game.h"
#include "block.h"
#include "item.h"
#include "player.h"
#include "enemy.h"
#include "effect.h"
#include "particle.h"
#include "GameBg.h"
#include "fade.h"

//*************************************************************************************************
//*** マクロ定義 ***
//*************************************************************************************************

//*************************************************************************************************
//*** グローバル変数 ***
//*************************************************************************************************
bool g_bPause;

//================================================================================================================
// --- ゲーム関連cppファイルの初期化 ---
//================================================================================================================
void InitGame(void)
{
	/*** プレイヤーの初期化 ***/
	InitPlayer();

	/*** ブロックの初期化 ***/
	InitBlock();

	/*** アイテムの初期化 ***/
	InitItem();

	/*** 敵の初期化 ***/
	InitEnemy();

	/*** エフェクトの初期化 ***/
	InitEffect();

	/*** パーティクルの初期化 ***/
	InitParticle();

	/*** ゲーム用背景の初期化 ***/
	InitGameBg();

	

	/*** ブロックの配置 ***/
	SetBlock(D3DXVECTOR3(100.0f, 620.0f, 0.0f), D3DXVECTOR3(0.0f, 5.0f, 0.0f), D3DXCOLOR_NULL, BLOCKTYPE_WALL, 50.0f, 50.0f, D3DXVECTOR4(0.0f, 150.0f, 300.0f, 720.0f));

	SetBlock(D3DXVECTOR3(1000.0f, 620.0f, 0.0f), D3DXVECTOR3_NULL, D3DXCOLOR_NULL, BLOCKTYPE_TRAP, 50.0f, 50.0f);

	/*** ファイルデータからブロックの配置 ***/
	SetBlockFromFile("data\\bin\\stage_0.bin");

	SetBlockFromFile("data\\bin\\frame.bin");

	SetEnemy(D3DXVECTOR3(700.0f, 600.0f, 0.0f), D3DXVECTOR3(1.0f, 0.0f, 0.0f), D3DXCOLOR_NULL, ENEMYTEX_SLIME, 50.0f, 50.0f, 10, OR_GRAVITY_GRAVITY);

	/*** ゲーム用背景の有効化 ***/
	SetEnableGameBg(true);
}

//================================================================================================================
// --- ゲーム関連cppファイルの終了 ---
//================================================================================================================
void UninitGame(void)
{
	/*** プレイヤーの終了 ***/
	UninitPlayer();

	/*** ブロックの終了 ***/
	UninitBlock();

	/*** アイテムの終了 ***/
	UninitItem();

	/*** 敵の終了 ***/
	UninitEnemy();

	/*** エフェクトの終了 ***/
	UninitEffect();

	/*** パーティクルの終了 ***/
	UninitParticle();

	/*** 背景の終了 ***/
	UninitGameBg();
}

//================================================================================================================
// --- ゲーム関連cppファイルの更新 ---
//================================================================================================================
void UpdateGame(void)
{
	if (g_bPause == false)
	{
		/*** プレイヤーの更新 ***/
		UpdatePlayer();

		/*** ブロックの更新 ***/
		UpdateBlock();

		/*** アイテムの更新 ***/
		UpdateItem();

		/*** 敵の更新 ***/
		UpdateEnemy();

		/*** エフェクトの更新 ***/
		UpdateEffect();

		/*** パーティクルの更新 ***/
		UpdateParticle();

		/*** 背景の更新 ***/
		UpdateGameBg();
	}
#if ENABLE_LOOP == true
	if (GetKeyboardTrigger(DIK_RETURN)
		&& GetFade() == FADE_NONE)
	{
		SetFade(MODE_RESULT, FADE_TYPE_NORMAL);
	}
#endif
}

//================================================================================================================
// --- ゲーム関連cppファイルの描画 ---
//================================================================================================================
void DrawGame(void)
{
	/*** 背景の描画 ***/
	DrawGameBg();

	/*** プレイヤーの描画 ***/
	DrawPlayer();

	/*** ブロックの描画 ***/
	DrawBlock();

	/*** アイテムの描画 ***/
	DrawItem();

	/*** 敵の描画 ***/
	DrawEnemy();

	/*** エフェクトの描画 ***/
	DrawEffect();

	/*** パーティクルの描画 ***/
	DrawParticle();
}