//================================================================================================================
//
// DirectXのゲーム関連用のcppファイル [game.cpp]
// Author : TENMA
//
//================================================================================================================
//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "game.h"
#include "block.h"
#include "item.h"
#include "player.h"
#include "enemy.h"
#include "GameBg.h"

//*************************************************************************************************
//*** マクロ定義 ***
//*************************************************************************************************

//*************************************************************************************************
//*** グローバル変数 ***
//*************************************************************************************************
bool g_bPause;

//================================================================================================================
// --- ゲーム関連cppファイルの初期化 ---
//================================================================================================================
void InitGame(void)
{
	/*** プレイヤーの初期化 ***/
	InitPlayer();

	/*** ブロックの初期化 ***/
	InitBlock();

	/*** アイテムの初期化 ***/
	InitItem();

	/*** 敵の初期化 ***/
	InitEnemy();

	/*** ゲーム用背景の初期化 ***/
	InitGameBg();

	/*** アイテムの設置 ***/
	SetItem(ITEMTYPE_STAR, D3DXVECTOR3(50.0f + ITEM_WIDTH * 0.5f, 50.0f + ITEM_HEIGHT, 0.0f), D3DXCOLOR_NULL, OR_GRAVITY_GRAVITY);

	SetItem(ITEMTYPE_STAR, D3DXVECTOR3((SCREEN_WIDTH - 50.0f) - (ITEM_WIDTH * 0.5f), SCREEN_HEIGHT - 50.0f, 0.0f), D3DXCOLOR_NULL, OR_GRAVITY_GRAVITY);

	SetItem(ITEMTYPE_STAR, D3DXVECTOR3(50.0f + ITEM_WIDTH * 0.5f, SCREEN_HEIGHT - 50.0f, 0.0f), D3DXCOLOR_NULL, OR_GRAVITY_GRAVITY);

	SetItem(ITEMTYPE_STAR, D3DXVECTOR3((SCREEN_WIDTH - 50.0f) - (ITEM_WIDTH * 0.5f), 50.0f + ITEM_HEIGHT, 0.0f), D3DXCOLOR_NULL, OR_GRAVITY_GRAVITY);

	/*** ファイルデータからブロックの配置 ***/
	SetBlockFromFile("data\\bin\\stage_0.bin");

	/*** ブロックの配置 ***/
	SetBlock(D3DXVECTOR3(100.0f, 620.0f, 0.0f), D3DXVECTOR3(0.0f, 5.0f, 0.0f), D3DXCOLOR_NULL, BLOCKTYPE_WALL, 50.0f, 50.0f, D3DXVECTOR4(0.0f, 100.0f, 300.0f, 720.0f));

	SetEnemy(D3DXVECTOR3(700.0f, 600.0f, 0.0f), D3DXVECTOR3_NULL, D3DXCOLOR_NULL, ENEMYTEX_SLIME, 50.0f, 50.0f, 10);

	SetEnemy(D3DXVECTOR3(100.0f, 600.0f, 0.0f), D3DXVECTOR3_NULL, D3DXCOLOR_NULL, ENEMYTEX_SLIME, 50.0f, 50.0f, 10);

	SetItem(ITEMTYPE_STAR, D3DXVECTOR3(150.0f + ITEM_WIDTH * 0.5f, SCREEN_HEIGHT - 50.0f, 0.0f), D3DXCOLOR_NULL, OR_GRAVITY_GRAVITY);

	/*** ゲーム用背景の有効化 ***/
	SetEnableGameBg(true);
}

//================================================================================================================
// --- ゲーム関連cppファイルの終了 ---
//================================================================================================================
void UninitGame(void)
{
	/*** プレイヤーの終了 ***/
	UninitPlayer();

	/*** ブロックの終了 ***/
	UninitBlock();

	/*** アイテムの終了 ***/
	UninitItem();

	/*** 敵の終了 ***/
	UninitEnemy();

	/*** 背景の終了 ***/
	UninitGameBg();
}

//================================================================================================================
// --- ゲーム関連cppファイルの更新 ---
//================================================================================================================
void UpdateGame(void)
{
	if (g_bPause == false)
	{
		/*** プレイヤーの更新 ***/
		UpdatePlayer();

		/*** ブロックの更新 ***/
		UpdateBlock();

		/*** アイテムの更新 ***/
		UpdateItem();

		/*** 敵の更新 ***/
		UpdateEnemy();

		/*** 背景の更新 ***/
		UpdateGameBg();
	}
}

//================================================================================================================
// --- ゲーム関連cppファイルの描画 ---
//================================================================================================================
void DrawGame(void)
{
	/*** 背景の描画 ***/
	DrawGameBg();

	/*** プレイヤーの描画 ***/
	DrawPlayer();

	/*** ブロックの描画 ***/
	DrawBlock();

	/*** アイテムの描画 ***/
	DrawItem();

	/*** 敵の描画 ***/
	DrawEnemy();
}