//================================================================================================================
//
// DirectXのゲーム関連用のcppファイル [game.cpp]
// Author : TENMA
//
//================================================================================================================
//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "game.h"
#include "block.h"
#include "item.h"
#include "player.h"
#include "enemy.h"
#include "effect.h"
#include "particle.h"
#include "exit.h"
#include "GameBg.h"
#include "fade.h"
#include "stage.h"
#include "ui.h"
#include "pause.h"
#include "stageNum.h"
#include "reverse.h"
#include "explosion.h"

//*************************************************************************************************
//*** マクロ定義 ***
//*************************************************************************************************

//*************************************************************************************************
//*** プロトタイプ宣言 ***
//*************************************************************************************************

//*************************************************************************************************
//*** グローバル変数 ***
//*************************************************************************************************
int g_nCounterState;
bool g_bPause;
GAMESTATE g_gameState = GAMESTATE_NORMAL;

//================================================================================================================
// --- ゲーム関連cppファイルの初期化 ---
//================================================================================================================
void InitGame(void)
{
	/*** 変数の初期化 ***/
	g_nCounterState = 0;
	g_gameState = GAMESTATE_NORMAL;
	g_bPause = false;

	/*** プレイヤーの初期化 ***/
	InitPlayer();

	/*** ブロックの初期化 ***/
	InitBlock();

	/*** アイテムの初期化 ***/
	InitItem();

	/*** 敵の初期化 ***/
	InitEnemy();

	/*** エフェクトの初期化 ***/
	InitEffect();

	/*** パーティクルの初期化 ***/
	InitParticle();

	/*** ゲーム用背景の初期化 ***/
	InitGameBg();

	/*** 出口の初期化 ***/
	InitExit();

	/*** ステージ読み込みの初期化 ***/
	InitStage();

	/*** UI表示の初期化 ***/
	InitUi();
	
	/*** ポーズ画面表示の初期化 ***/
	InitPause();

	/*** 重力反転時演出の初期化 ***/
	InitReverse();

	/*** 爆発演出の初期化 ***/
	InitExplosion();

	/*** ステージの設定 ***/
	SetStage(GetStageExac());

	/*** UIの設定 ***/
	SetUi();

	/*** ゲーム用背景の有効化 ***/
	SetEnableGameBg(true);
}

//================================================================================================================
// --- ゲーム関連cppファイルの終了 ---
//================================================================================================================
void UninitGame(void)
{
	/*** プレイヤーの終了 ***/
	UninitPlayer();

	/*** ブロックの終了 ***/
	UninitBlock();

	/*** アイテムの終了 ***/
	UninitItem();

	/*** 敵の終了 ***/
	UninitEnemy();

	/*** エフェクトの終了 ***/
	UninitEffect();

	/*** パーティクルの終了 ***/
	UninitParticle();

	/*** 背景の終了 ***/
	UninitGameBg();

	/*** UIの終了 ***/
	UninitUi();

	/*** ポーズ画面表示の終了 ***/
	UninitPause();

	/*** 出口の終了 ***/
	UninitExit();

	/*** 重力反転時演出の終了 ***/
	UninitReverse();

	/*** 爆発演出の終了 ***/
	UninitExplosion();
}

//================================================================================================================
// --- ゲーム関連cppファイルの更新 ---
//================================================================================================================
void UpdateGame(void)
{
	/*** ゲームの状態により処理を変更 ***/
	switch (g_gameState)
	{
	// 何もなし
	case GAMESTATE_NONE:

		break;

	// 通常状態
	case GAMESTATE_NORMAL:

		break;

	// ゲームクリア
	case GAMESTATE_CLEAREND:

		g_nCounterState--;
		if (g_nCounterState <= 0)
		{
			if (GetFade() == FADE_NONE)
			{ // リザルト画面へ移行
				SetFade(MODE_RESULT, FADE_TYPE_NORMAL);
				FadeSound(SOUND_LABEL_BGM_RESULT);
			}
		}

		break;

	// ゲームオーバー
	case GAMESTATE_BADEND:

		g_nCounterState--;
		if (g_nCounterState <= 0)
		{
			if (GetFade() == FADE_NONE)
			{ // リザルト画面へ移行
				SetFade(MODE_RESULT, FADE_TYPE_NORMAL);
				FadeSound(SOUND_LABEL_BGM_RESULT);
			}
		}

		break;
	}
	
	/*** ゲーム状態が通常なら ***/
	if (g_gameState == GAMESTATE_NORMAL)
	{
		/*** ポーズボタンを押したとき ***/
		if (GetKeyboardTrigger(DIK_P)
			|| GetJoypadTrigger(JOYKEY_START))
		{
			g_bPause = g_bPause ^ true;
		}
	}

	/*** ポーズ状態でなければ更新 ***/
	if (g_bPause == false)
	{
		/*** プレイヤーの更新 ***/
		UpdatePlayer();

		/*** ブロックの更新 ***/
		UpdateBlock();

		/*** アイテムの更新 ***/
		UpdateItem();

		/*** 敵の更新 ***/
		UpdateEnemy();

		/*** エフェクトの更新 ***/
		UpdateEffect();

		/*** パーティクルの更新 ***/
		UpdateParticle();

		/*** 出口の更新 ***/
		UpdateExit();

		/*** 背景の更新 ***/
		UpdateGameBg();

		/*** UIの更新 ***/
		UpdateUi();

		/*** 重力反転時演出の更新 ***/
		UpdateReverse();

		/*** 爆発演出の更新 ***/
		UpdateExplosion();
	}
	
	/*** ポーズの更新 ***/
	UpdatePause();
	

#if ENABLE_LOOP == true
	if (GetKeyboardTrigger(DIK_RETURN)
		&& GetFade() == FADE_NONE)
	{
		SetFade(MODE_RESULT, FADE_TYPE_NORMAL);
	}
#endif
}

//================================================================================================================
// --- ゲーム関連cppファイルの描画 ---
//================================================================================================================
void DrawGame(void)
{
	/*** 背景の描画 ***/
	DrawGameBg();

	/*** 出口の描画 ***/
	DrawExit();

	/*** ブロックの描画 ***/
	DrawBlock();

	/*** 爆発演出の描画 ***/
	DrawExplosion();

	/*** アイテムの描画 ***/
	DrawItem();

	/*** エフェクトの描画 ***/
	DrawEffect();

	/*** プレイヤーの描画 ***/
	DrawPlayer();

	/*** UIの描画 ***/
	DrawUi();

	/*** 敵の描画 ***/
	DrawEnemy();

	/*** パーティクルの描画 ***/
	DrawParticle();

	/*** 重力反転時演出の描画 ***/
	DrawReverse();

	/*** ポーズ状態であれば描画 ***/
	if (g_bPause == true)
	{
		/*** ポーズの描画 ***/
		DrawPause();
	}
}

//================================================================================================================
// --- ステージ終了処理 ---
//================================================================================================================
void SetEndStage(void)
{
	int nStage = GetStage();

	nStage++;

	/*** ゲームの状態が通常の時に判定 ***/
	if (g_gameState == GAMESTATE_NORMAL)
	{
		if ((nStage >= GetStageMax()))
		{
			/*** ゲームの状態をクリアに設定 ***/
			SetGameState(GAMESTATE_CLEAREND, 60);

			/*** 現在のステージ番号をリセットする ***/
			SetStageExac(0);
		}
		else
		{
			AddStageNum(1);

			ResetStage(false);

			/*** 現在のステージ番号を進める ***/
			SetStage(nStage);
		}
	}
}

//================================================================================================================
// --- ゲーム状態の設定処理 ---
//================================================================================================================
void SetGameState(GAMESTATE state, int nCounter)
{
	/*** ゲーム状態を設定 ***/
	g_gameState = state;

	/*** その状態の維持時間を設定 ***/
	g_nCounterState = nCounter;
}

//================================================================================================================
// --- ゲーム状態の設定処理 ---
//================================================================================================================
void SetEnablePause(bool bPause)
{
	g_bPause = bPause;
}

//================================================================================================================
// --- ゲーム状態の取得処理 ---
//================================================================================================================
bool GetEnablePause(void)
{
	return g_bPause;
}