//================================================================================================================
//
// DirectXのゲーム関連用のcppファイル [game.cpp]
// Author : TENMA
//
//================================================================================================================
//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "game.h"
#include "block.h"
#include "item.h"
#include "player.h"
#include "enemy.h"
#include "effect.h"
#include "particle.h"
#include "exit.h"
#include "GameBg.h"
#include "fade.h"
#include "stage.h"

//*************************************************************************************************
//*** マクロ定義 ***
//*************************************************************************************************

//*************************************************************************************************
//*** プロトタイプ宣言 ***
//*************************************************************************************************
void SetGameState(GAMESTATE state, int nCounter);

//*************************************************************************************************
//*** グローバル変数 ***
//*************************************************************************************************
int g_nCounterState;
bool g_bPause;
GAMESTATE g_gameState = GAMESTATE_NORMAL;

//================================================================================================================
// --- ゲーム関連cppファイルの初期化 ---
//================================================================================================================
void InitGame(void)
{
	/*** 変数の初期化 ***/
	g_nCounterState = 0;
	g_gameState = GAMESTATE_NORMAL;

	/*** プレイヤーの初期化 ***/
	InitPlayer();

	/*** ブロックの初期化 ***/
	InitBlock();

	/*** アイテムの初期化 ***/
	InitItem();

	/*** 敵の初期化 ***/
	InitEnemy();

	/*** エフェクトの初期化 ***/
	InitEffect();

	/*** パーティクルの初期化 ***/
	InitParticle();

	/*** ゲーム用背景の初期化 ***/
	InitGameBg();

	/*** 出口の初期化 ***/
	InitExit();

	/*** ステージ読み込みの初期化 ***/
	InitStage();
	
	SetStage(0);

	/*** ブロックの配置 ***/
	SetBlock(D3DXVECTOR3(100.0f, 620.0f, 0.0f), D3DXVECTOR3(0.0f, 5.0f, 0.0f), D3DXCOLOR_NULL, BLOCKTYPE_WALL, 50.0f, 50.0f, D3DXVECTOR4(0.0f, 150.0f, 300.0f, 720.0f));

	SetBlock(D3DXVECTOR3(1000.0f, 620.0f, 0.0f), D3DXVECTOR3_NULL, D3DXCOLOR_NULL, BLOCKTYPE_TRAP, 50.0f, 50.0f);

	/*** ファイルデータからブロックの配置 ***/
	SetBlockFromFile("data\\bin\\stage_0.bin");

	SetBlockFromFile("data\\bin\\frame.bin");

	SetEnemy(D3DXVECTOR3(700.0f, 600.0f, 0.0f), D3DXVECTOR3(1.0f, -7.5f, 0.0f), D3DXCOLOR_NULL, ENEMYTYPE_SLIME, 50.0f, 50.0f, 10, OR_GRAVITY_GRAVITY);

	/*** ゲーム用背景の有効化 ***/
	SetEnableGameBg(true);
}

//================================================================================================================
// --- ゲーム関連cppファイルの終了 ---
//================================================================================================================
void UninitGame(void)
{
	/*** プレイヤーの終了 ***/
	UninitPlayer();

	/*** ブロックの終了 ***/
	UninitBlock();

	/*** アイテムの終了 ***/
	UninitItem();

	/*** 敵の終了 ***/
	UninitEnemy();

	/*** エフェクトの終了 ***/
	UninitEffect();

	/*** パーティクルの終了 ***/
	UninitParticle();

	/*** 背景の終了 ***/
	UninitGameBg();

	/*** 出口の終了 ***/
	UninitExit();
}

//================================================================================================================
// --- ゲーム関連cppファイルの更新 ---
//================================================================================================================
void UpdateGame(void)
{
	switch (g_gameState)
	{
	case GAMESTATE_NONE:

		break;

	case GAMESTATE_NORMAL:

		break;

	case GAMESTATE_CLEAREND:

		g_nCounterState--;
		if (g_nCounterState <= 0)
		{
			if (GetFade() == FADE_NONE)
			{
				SetFade(MODE_RESULT, FADE_TYPE_NORMAL);
			}
		}

		break;
	}

	if (g_bPause == false)
	{
		/*** プレイヤーの更新 ***/
		UpdatePlayer();

		/*** ブロックの更新 ***/
		UpdateBlock();

		/*** アイテムの更新 ***/
		UpdateItem();

		/*** 敵の更新 ***/
		UpdateEnemy();

		/*** エフェクトの更新 ***/
		UpdateEffect();

		/*** パーティクルの更新 ***/
		UpdateParticle();

		/*** 出口の更新 ***/
		UpdateExit();

		/*** 背景の更新 ***/
		UpdateGameBg();
	}
#if ENABLE_LOOP == true
	if (GetKeyboardTrigger(DIK_RETURN)
		&& GetFade() == FADE_NONE)
	{
		SetFade(MODE_RESULT, FADE_TYPE_NORMAL);
	}
#endif
}

//================================================================================================================
// --- ゲーム関連cppファイルの描画 ---
//================================================================================================================
void DrawGame(void)
{
	/*** 背景の描画 ***/
	DrawGameBg();

	/*** プレイヤーの描画 ***/
	DrawPlayer();

	/*** ブロックの描画 ***/
	DrawBlock();

	/*** アイテムの描画 ***/
	DrawItem();

	/*** 敵の描画 ***/
	DrawEnemy();

	/*** 出口の描画 ***/
	DrawExit();

	/*** エフェクトの描画 ***/
	DrawEffect();

	/*** パーティクルの描画 ***/
	DrawParticle();
}

//================================================================================================================
// --- ステージ終了処理 ---
//================================================================================================================
void SetEndStage(void)
{
	if (g_gameState == GAMESTATE_NORMAL)
	{
		SetGameState(GAMESTATE_CLEAREND, 60);
	}
}

//================================================================================================================
// --- ゲーム状態の設定処理 ---
//================================================================================================================
void SetGameState(GAMESTATE state, int nCounter)
{
	g_gameState = state;

	g_nCounterState = nCounter;
}