//================================================================================================================
//
// DirectXのアイテムヘッダファイル [item.h]
// Author : TENMA
//
//================================================================================================================
#ifndef _ITEM_H_
#define _ITEM_H_

//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "game.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************
#define ITEM_WIDTH		(50)			// ブロックの横のサイズ
#define ITEM_HEIGHT		(50)			// ブロックの高さ

//**********************************************************************************
//*** アイテムの種類 ***
//**********************************************************************************
typedef enum
{
	ITEMTYPE_STAR = 0,			// 星
	ITEMTYPE_MAX
}ITEMTYPE;

//**********************************************************************************
//*** アイテム構造体 ***
//**********************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;				// アイテムの位置
	D3DXCOLOR col;					// アイテムの色
	ITEMTYPE type;					// アイテムの種類
	GRAVITY gravity;				// 重力
	float fWidth;					// アイテムの横幅
	float fHeight;					// アイテムの縦幅
	int nAlphaItem;					// アイテムのα値
	int nCounterAnim;				// アイテムのアニメーションカウンター
	int nPatternAnim;				// アイテムのアニメーションパターン
	bool bUse;						// アイテムが使われているかどうか
	bool bCatched;					// アイテムが取得されたかどうか
}ITEM;

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitItem(void);
void UninitItem(void);
void UpdateItem(void);
void DrawItem(void);

void SetItem(ITEMTYPE type, D3DXVECTOR3 pos, D3DXCOLOR col, OR_GRAVITY gravity, float fWidth = ITEM_WIDTH, float fHeight = ITEM_HEIGHT);
void CollisionItem(D3DXVECTOR3 pos, float fWidth, float fHeight);
void DestroyItem(void);
#endif
