//================================================================================================================
//
// DirectXの計算関連ヘッダファイル [math.h]
// Author : TENMA
//
//================================================================================================================
#ifndef _MATH_H_
#define _MATH_H_

//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "main.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
bool CollisionBox(RECT rect, D3DXVECTOR3 pos);
HRESULT CheckIndex(int TargetIndexMax, int Index);
POINT_RECT SetPointRect(D3DXVECTOR3 p1, D3DXVECTOR3 p2, D3DXVECTOR3 p3, D3DXVECTOR3 p4);
POINT_RECT SetRectToPointRect(RECT rect);
void HomingPosToPos(D3DXVECTOR3 posTarget, D3DXVECTOR3 *posMover, float fSpeed);
float GetPosToPos(D3DXVECTOR3 posTarget, D3DXVECTOR3 posMover);

#endif
