//================================================================================================================
//
// DirectXのクレジット背景用ヘッダファイル [creditBg.h]
// Author : TENMA
//
//================================================================================================================
#ifndef _PLAYER_H_
#define _PLAYER_H_

#include "main.h"
//**********************************************************************************
//*** 重力の種類 ***
//**********************************************************************************
typedef enum
{
	OR_GRAVITY_GRAVITY = 0,		// 下への重力
	OR_GRAVITY_ANTI_GRAVITY,	// 上への重力
	OR_GRAVITY_MAX
}OR_GRAVITY;

//**********************************************************************************
//*** 重力構造体 ***
//**********************************************************************************
typedef struct
{
	float nGravity;				// 現在の重力の値
	OR_GRAVITY orGravity;		// 重力の向き
}GRAVITY;

//**********************************************************************************
//*** プレイヤー構造体 ***
//**********************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;			// 位置
	D3DXVECTOR3 rot;			// 角度
	D3DXVECTOR3 move;			// 移動量
	int nCounterAnim;			// アニメーションカウンター
	int nPatternAnim;			// アニメーションNo
	bool bRight;				// 右向きか
	bool bJump;					// ジャンプ中か
	GRAVITY gravity;			// プレイヤーへの重力
}PLAYER;

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitPlayer(void);
void UninitPlayer(void);
void UpdatePlayer(void);
void DrawPlayer(void);

#endif