//================================================================================================================
//
// DirectXのクレジット背景用ヘッダファイル [creditBg.h]
// Author : TENMA
//
//================================================================================================================
#ifndef _PLAYER_H_
#define _PLAYER_H_

//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "game.h"
#include "block.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************
#define PLAYER_SPAWN	D3DXVECTOR3(100.0f + (PLAYER_WIDTH * 0.5f), SCREEN_HEIGHT - PLAYER_HEIGHT + 100.0f, 0.0f)			// プレイヤーの初期スポーン位置

//**********************************************************************************
//*** プレイヤーの状態 ***
//**********************************************************************************
typedef enum
{
	PLAYERSTATE_NORMAL = 0,		// 通常時
	PLAYERSTATE_APPEAR,			// 出現、待機時
	PLAYERSTATE_DEATH,			// 死亡時
	PLAYERSTATE_LOST,			// 残機なしの死亡時
	PLAYERSTATE_MAX
}PLAYERSTATE;

//**********************************************************************************
//*** プレイヤー構造体 ***
//**********************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;			// 現在の位置
	D3DXVECTOR3 posOld;			// 過去の位置
	D3DXVECTOR3 move;			// 移動量
	D3DXCOLOR col;				// 色
	PLAYERSTATE state;			// 状態
	int nCounterState;			// 状態カウンター
	int nCounterAnim;			// アニメーションカウンター
	int nPatternAnim;			// アニメーションNo
	float fWidth;				// 横幅
	float fHeight;				// 身長
	bool bGravityInverseTime;	// 重力反転中か
	int nRight;					// 右向きか
	bool bJump;					// ジャンプ中か
	GRAVITY gravity;			// プレイヤーへの重力
	BLOCK *pBlock;				// 対象ブロックのポインタ
}PLAYER;

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitPlayer(void);
void UninitPlayer(void);
void UpdatePlayer(void);
void DrawPlayer(void);

PLAYER *GetPlayer(void);
void SetPlayerDeath(void);
void ResetPlayer(bool bUseEffect);

#endif