//================================================================================================================
//
// DirectXのクレジット背景用ヘッダファイル [creditBg.h]
// Author : TENMA
//
//================================================================================================================
#ifndef _PLAYER_H_
#define _PLAYER_H_

//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "game.h"
#include "block.h"

//**********************************************************************************
//*** プレイヤー構造体 ***
//**********************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;			// 現在の位置
	D3DXVECTOR3 posOld;			// 過去の位置
	D3DXVECTOR3 move;			// 移動量
	int nCounterAnim;			// アニメーションカウンター
	int nPatternAnim;			// アニメーションNo
	float fWidth;				// 横幅
	float fHeight;				// 身長
	bool bGravityInverseTime;	// 重力反転中か
	int nRight;					// 右向きか
	bool bJump;					// ジャンプ中か
	GRAVITY gravity;			// プレイヤーへの重力
	BLOCK *pBlock;				// 対象ブロックのポインタ
}PLAYER;

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitPlayer(void);
void UninitPlayer(void);
void UpdatePlayer(void);
void DrawPlayer(void);

PLAYER *GetPlayer(void);

#endif