//================================================================================================================
//
// DirectXのクレジット背景用ヘッダファイル [creditBg.h]
// Author : TENMA
//
//================================================================================================================
#ifndef _PLAYER_H_
#define _PLAYER_H_

#include "main.h"

//**********************************************************************************
//*** プレイヤー構造体 ***
//**********************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;			// 位置
	D3DXVECTOR3 rot;			// 角度
	D3DXVECTOR3 move;			// 移動量
	int nCounterAnim;			// アニメーションカウンター
	int nPatternAnim;			// アニメーションNo
	bool bRight;				// 右向きか
	bool bJump;					// ジャンプ中か
}PLAYER;

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitPlayer(void);
void UninitPlayer(void);
void UpdatePlayer(void);
void DrawPlayer(void);

#endif