//================================================================================================================
//
// DirectXのリザルト背景表示処理 [resultBg.cpp]
// Author : TENMA
//
//================================================================================================================
//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "resultBg.h"
#include "fade.h"

//*************************************************************************************************
//*** マクロ定義 ***
//*************************************************************************************************
bool g_bUseResultBg;			// リザルトの背景の使用状況

//*************************************************************************************************
//*** グローバル変数 ***
//*************************************************************************************************
LPDIRECT3DTEXTURE9		g_pTextureResultBg = NULL;	// テクスチャへのポインタ
LPDIRECT3DVERTEXBUFFER9 g_pVtxBuffResultBg = NULL;	// 頂点バッファのポインタ

//================================================================================================================
// --- リザルト用背景の初期化処理 ---
//================================================================================================================
void InitResultBg(void)
{
	/*** デバイスの取得 ***/
	LPDIRECT3DDEVICE9 pDevice = GetDevice();
	VERTEX_2D *pVtx;					// 頂点情報へのポインタ

	g_bUseResultBg = false;				// 背景を不使用に

	/*** テクスチャの読み込み ***/
	D3DXCreateTextureFromFile(pDevice,
							  "data\\TEXTURE\\BG\\RESULT\\MoonAndStars.png",
							  &g_pTextureResultBg);

	/*** 頂点バッファの生成 ***/
	pDevice->CreateVertexBuffer(sizeof(VERTEX_2D) * 4,
								D3DUSAGE_WRITEONLY,
								FVF_VERTEX_2D,
								D3DPOOL_MANAGED,
								&g_pVtxBuffResultBg,
								NULL);

	/*** 頂点バッファの設定 ***/
	g_pVtxBuffResultBg->Lock(0, 0, (void**)&pVtx, 0);

	/*** 頂点座標の設定の設定 ***/
	pVtx[0].pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	pVtx[1].pos = D3DXVECTOR3(SCREEN_WIDTH, 0.0f, 0.0f);
	pVtx[2].pos = D3DXVECTOR3(0.0f, SCREEN_HEIGHT, 0.0f);
	pVtx[3].pos = D3DXVECTOR3(SCREEN_WIDTH, SCREEN_HEIGHT, 0.0f);

	/*** rhwの設定 ***/
	pVtx[0].rhw = 1.0f;
	pVtx[1].rhw = 1.0f;
	pVtx[2].rhw = 1.0f;
	pVtx[3].rhw = 1.0f;

	/*** 頂点カラー設定 ***/
	pVtx[0].col = D3DXCOLOR_NULL;
	pVtx[1].col = D3DXCOLOR_NULL;
	pVtx[2].col = D3DXCOLOR_NULL;
	pVtx[3].col = D3DXCOLOR_NULL;

	/*** テクスチャ座標の設定 ***/
	pVtx[0].tex = D3DXVECTOR2(0.0f, 0.0f);
	pVtx[1].tex = D3DXVECTOR2(1.0f, 0.0f);
	pVtx[2].tex = D3DXVECTOR2(0.0f, 1.0f);
	pVtx[3].tex = D3DXVECTOR2(1.0f, 1.0f);

	/*** 頂点バッファの設定を終了 ***/
	g_pVtxBuffResultBg->Unlock();
}

//================================================================================================================
// --- リザルト用背景の終了処理 ---
//================================================================================================================
void UninitResultBg(void)
{
	/*** テクスチャの破棄 ***/
	if (g_pTextureResultBg != NULL)
	{
		g_pTextureResultBg->Release();
		g_pTextureResultBg = NULL;
	}

	/*** 頂点バッファの破棄 ***/
	if (g_pVtxBuffResultBg != NULL)
	{
		g_pVtxBuffResultBg->Release();
		g_pVtxBuffResultBg = NULL;
	}
}

//================================================================================================================
// --- リザルト用背景の更新処理 ---
//================================================================================================================
void UpdateResultBg(void)
{

}

//================================================================================================================
// --- リザルト用背景の描画処理 ---
//================================================================================================================
void DrawResultBg(void)
{
	/*** デバイスの取得 ***/
	LPDIRECT3DDEVICE9 pDevice = GetDevice();

	/*** 頂点バッファをデータストリームに設定 ***/
	pDevice->SetStreamSource(0, g_pVtxBuffResultBg, 0, sizeof(VERTEX_2D));

	/*** 頂点フォーマットの設定 ***/
	pDevice->SetFVF(FVF_VERTEX_2D);
	
	if (g_bUseResultBg)
	{
		/*** テクスチャの設定 ***/
		pDevice->SetTexture(0, g_pTextureResultBg);

		/*** ポリゴンの描画 ***/
		pDevice->DrawPrimitive(D3DPT_TRIANGLESTRIP,		// プリミティブの種類
			0,											// 描画する最初の頂点インデックス
			2);											// 描画するプリミティブの数
	}
}

//================================================================================================================
// --- リザルト用背景の描画設定処理 ---
//================================================================================================================
void SetEnableResultBg(bool bUse)
{
	g_bUseResultBg = bUse;
}