//================================================================================================================
//
// DirectXのタイトル背景表示処理 [titleBg.cpp]
// Author : TENMA
//
//================================================================================================================
//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "titleBg.h"

//*************************************************************************************************
//*** マクロ定義 ***
//*************************************************************************************************
bool g_bUseTitleBg;			// タイトルの背景の使用状況

//*************************************************************************************************
//*** グローバル変数 ***
//*************************************************************************************************
LPDIRECT3DTEXTURE9		g_pTextureTitleBg = NULL;	// テクスチャへのポインタ
LPDIRECT3DVERTEXBUFFER9 g_pVtxBuffTitleBg = NULL;	// 頂点バッファのポインタ

//================================================================================================================
// --- タイトル用背景の初期化処理 ---
//================================================================================================================
void InitTitleBg(void)
{
	/*** デバイスの取得 ***/
	LPDIRECT3DDEVICE9 pDevice = GetDevice();
	VERTEX_2D *pVtx;					// 頂点情報へのポインタ

	g_bUseTitleBg = false;				// 背景を不使用に

	/*** テクスチャの読み込み ***/
	D3DXCreateTextureFromFile(pDevice,
							  "data\\TEXTURE\\BG\\TITLE\\IzayoiCollecter.jpg",
							  &g_pTextureTitleBg);

	/*** 頂点バッファの生成 ***/
	pDevice->CreateVertexBuffer(sizeof(VERTEX_2D) * 4,
								D3DUSAGE_WRITEONLY,
								FVF_VERTEX_2D,
								D3DPOOL_MANAGED,
								&g_pVtxBuffTitleBg,
								NULL);

	/*** 頂点バッファの設定 ***/
	g_pVtxBuffTitleBg->Lock(0, 0, (void**)&pVtx, 0);

	/*** 頂点座標の設定の設定 ***/
	pVtx[0].pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	pVtx[1].pos = D3DXVECTOR3(SCREEN_WIDTH, 0.0f, 0.0f);
	pVtx[2].pos = D3DXVECTOR3(0.0f, SCREEN_HEIGHT, 0.0f);
	pVtx[3].pos = D3DXVECTOR3(SCREEN_WIDTH, SCREEN_HEIGHT, 0.0f);

	/*** rhwの設定 ***/
	pVtx[0].rhw = 1.0f;
	pVtx[1].rhw = 1.0f;
	pVtx[2].rhw = 1.0f;
	pVtx[3].rhw = 1.0f;

	/*** 頂点カラー設定 ***/
	pVtx[0].col = D3DXCOLOR(0.5f, 0.5f, 0.5f, 1.0f);
	pVtx[1].col = D3DXCOLOR(0.5f, 0.5f, 0.5f, 1.0f);
	pVtx[2].col = D3DXCOLOR(0.5f, 0.5f, 0.5f, 1.0f);
	pVtx[3].col = D3DXCOLOR(0.5f, 0.5f, 0.5f, 1.0f);

	/*** テクスチャ座標の設定 ***/
	pVtx[0].tex = D3DXVECTOR2(0.0f, 0.0f);
	pVtx[1].tex = D3DXVECTOR2(1.0f, 0.0f);
	pVtx[2].tex = D3DXVECTOR2(0.0f, 1.0f);
	pVtx[3].tex = D3DXVECTOR2(1.0f, 1.0f);

	/*** 頂点バッファの設定を終了 ***/
	g_pVtxBuffTitleBg->Unlock();
}

//================================================================================================================
// --- タイトル用背景の終了処理 ---
//================================================================================================================
void UninitTitleBg(void)
{
	/*** テクスチャの破棄 ***/
	if (g_pTextureTitleBg != NULL)
	{
		g_pTextureTitleBg->Release();
		g_pTextureTitleBg = NULL;
	}

	/*** 頂点バッファの破棄 ***/
	if (g_pVtxBuffTitleBg != NULL)
	{
		g_pVtxBuffTitleBg->Release();
		g_pVtxBuffTitleBg = NULL;
	}
}

//================================================================================================================
// --- タイトル用背景の更新処理 ---
//================================================================================================================
void UpdateTitleBg(void)
{

}

//================================================================================================================
// --- タイトル用背景の描画処理 ---
//================================================================================================================
void DrawTitleBg(void)
{
	/*** デバイスの取得 ***/
	LPDIRECT3DDEVICE9 pDevice = GetDevice();

	/*** 頂点バッファをデータストリームに設定 ***/
	pDevice->SetStreamSource(0, g_pVtxBuffTitleBg, 0, sizeof(VERTEX_2D));

	/*** 頂点フォーマットの設定 ***/
	pDevice->SetFVF(FVF_VERTEX_2D);

	if (g_bUseTitleBg)
	{
		/*** テクスチャの設定 ***/
		pDevice->SetTexture(0, g_pTextureTitleBg);

		/*** ポリゴンの描画 ***/
		pDevice->DrawPrimitive(D3DPT_TRIANGLESTRIP,		// プリミティブの種類
			0,											// 描画する最初の頂点インデックス
			2);											// 描画するプリミティブの数
	}
}

//================================================================================================================
// --- タイトル用背景の描画設定処理 ---
//================================================================================================================
void SetEnableTitleBg(bool bUse)
{
	g_bUseTitleBg = bUse;
}