//================================================================================================================
//
// DirectXのUI表示用処理 [ui_star.cpp]
// Author : TENMA
//
//================================================================================================================
//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "ui.h"
#include "ui_stock.h"
#include "stockNum.h"
#include "ui_star.h"
#include "starNum.h"
#include "ui_stage.h"
#include "stageNum.h"

//*************************************************************************************************
//*** マクロ定義 ***
//*************************************************************************************************

//*************************************************************************************************
//*** スター数情報構造体 ***
//*************************************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;			// 位置
	float fWidth;				// 幅
	float fHeight;				// 高さ
}UI;

//*************************************************************************************************
//*** グローバル変数 ***
//*************************************************************************************************
const UI g_aUiData[] =
{
	{ D3DXVECTOR3(10.0f,5.0f,0.0f), 170.0f, 60.0f },
	{ D3DXVECTOR3(100.0f,15.0f,0.0f) },
	{ D3DXVECTOR3(200.0f,5.0f,0.0f), 170.0f, 60.0f },
	{ D3DXVECTOR3(300.0f,15.0f,0.0f) },
	{ D3DXVECTOR3(500.0f,5.0f,0.0f), 320.0f, 60.0f },
	{ D3DXVECTOR3(740.0f,15.0f,0.0f) },
};

//================================================================================================================
// --- UI表示の初期化 ---
//================================================================================================================
void InitUi(void)
{
	/*** ストック情報の初期化 ***/
	InitUiStock();

	/*** 残機数表示の初期化 ***/
	InitStockNum();

	/*** スター数情報の初期化 ***/
	InitUiStar();

	/*** スター数表示の初期化 ***/
	InitStarNum();

	/*** ステージ番号情報の初期化 ***/
	InitUiStage();

	/*** ステージ番号表示の初期化 ***/
	InitStageNum();
}

//================================================================================================================
// --- UI表示の終了 ---
//================================================================================================================
void UninitUi(void)
{
	/*** ストック情報の終了 ***/
	UninitUiStock();
	
	/*** 残機数表示の終了 ***/
	UninitStockNum();

	/*** スター数情報の終了 ***/
	UninitUiStar();

	/*** スター数表示の終了 ***/
	UninitStarNum();

	/*** ステージ番号情報の終了 ***/
	UninitUiStage();

	/*** ステージ番号表示の終了 ***/
	UninitStageNum();
}

//================================================================================================================
// --- UI表示の更新 ---
//================================================================================================================
void UpdateUi(void)
{
	/*** ストック情報の更新 ***/
	UpdateUiStock();

	/*** 残機数表示の更新 ***/
	UpdateStockNum();

	/*** スター数情報の更新 ***/
	UpdateUiStar();

	/*** スター数表示の更新 ***/
	UpdateStarNum();

	/*** ステージ番号情報の更新 ***/
	UpdateUiStage();

	/*** ステージ番号表示の更新 ***/
	UpdateStageNum();
}

//================================================================================================================
// --- UI表示の描画 ---
//================================================================================================================
void DrawUi(void)
{
	/*** ストック情報の描画 ***/
	DrawUiStock();

	/*** 残機数表示の描画 ***/
	DrawStockNum();
	
	/*** スター数情報の描画 ***/
	DrawUiStar();

	/*** スター数表示の描画 ***/
	DrawStarNum();

	/*** ステージ番号情報の描画 ***/
	DrawUiStage();

	/*** ステージ番号表示の描画 ***/
	DrawStageNum();
}

//================================================================================================================
// --- UI表示の表示処理 ---
//================================================================================================================
void SetUi(void)
{
	/*** ストック情報の設定 ***/
	SetUiStock(g_aUiData[0].pos, g_aUiData[0].fWidth, g_aUiData[0].fHeight);

	/*** 残機数表示の設定 ***/
	SetStockNum(10, g_aUiData[1].pos);
	
	/*** スター数情報の設定 ***/
	SetUiStar(g_aUiData[2].pos, g_aUiData[2].fWidth, g_aUiData[2].fHeight);

	/*** スター数表示の設定 ***/
	SetStarNum(0, g_aUiData[3].pos);

	/*** ステージ番号情報の設定 ***/
	SetUiStage(g_aUiData[4].pos, g_aUiData[4].fWidth, g_aUiData[4].fHeight);

	/*** ステージ番号表示の設定 ***/
	SetStageNum(1, g_aUiData[5].pos);
}